import cv2
import numpy as np

#创建图片(y,x) 通道3
img = np.zeros((480,640,3),np.uint8)

#画线坐标 (x,y)(x,y)  颜色(0,0,255) 线宽5 平滑16
cv2.line(img,(10,20),(300,400),(0,0,255),5,16)

#画矩形  (x,y)(x,y)  颜色(0,0,255)  -1实心 1宽度的空心 平滑16
cv2.rectangle(img,(10,10),(100,100),(0,0,255),-1,16)

#画圆  (x,y)(x,y)  颜色(0,0,255)  100-半径
cv2.circle(img,(320,240),100,(0,0,255),1,16)
cv2.circle(img,(320,240),50,(0,0,255),-1,16)

# 画椭圆
# 度是按顺时针计算的
# 0读是从左侧开始的
# 参数
# 1.画板
# 2.中心点
# 3.长宽的一半
# 4.角度
# 5.从哪个角度开始
# 6.到哪里角度结束
cv2.ellipse(img,(320,240),(100,50),0,0,360,(0,0,255),1,16)

# 画多边形
# 1.画板
# 2.点集合
# 3.是否闭环
# 4.颜色
pts = np.array([(300,10),(150,100),(450,100)],np.int32,)
cv2.polylines(img,[pts],True,(0,0,255))

# 填充多边形
cv2.fillPoly(img,[pts],(255,255,0))

# 画文本
# 1.画板
# 2.字符串
# 3.起始点
# 4.字体
# 5.字号
# 6.颜色
cv2.putText(img,"hello world",(10,400),cv2.FONT_HERSHEY_COMPLEX_SMALL,3,(255,255,255))


cv2.imshow("draw",img)
cv2.waitKey(0)